IRP/src/InformationRegisters/T9012S_AccountsPartner/T9012S_AccountsPartner.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>T9012S_AccountsPartner</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>AccountAdvancesVendor</name>
    <type>
      <types>ChartOfAccountsRef.Basic</types>
    </type>
  </resources>
  <resources>
    <name>AccountTransactionsVendor</name>
    <type>
      <types>ChartOfAccountsRef.Basic</types>
    </type>
  </resources>
  <resources>
    <name>AccountAdvancesCustomer</name>
    <type>
      <types>ChartOfAccountsRef.Basic</types>
    </type>
  </resources>
  <resources>
    <name>AccountTransactionsCustomer</name>
    <type>
      <types>ChartOfAccountsRef.Basic</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LedgerTypeVariant</name>
    <type>
      <types>CatalogRef.LedgerTypeVariants</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Agreement</name>
    <type>
      <types>CatalogRef.Agreements</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9012S_AccountsPartner/RecordSetModule.bsl
Procedure OnWrite(Cancel, Replacing)
	If DataExchange.Load Then
		Return;
	EndIf;
	RefreshReusableValues();
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	For Each Record In ThisObject Do
		Cancel = True;
		If ValueIsFilled(Record.AccountAdvancesVendor) And Record.AccountAdvancesVendor.NotUsedForRecords Then
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().AccountingError_01, Record.AccountAdvancesVendor.Code), "Account", ThisObject);
		EndIf;
		
		If ValueIsFilled(Record.AccountTransactionsVendor) And Record.AccountTransactionsVendor.NotUsedForRecords Then
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().AccountingError_01, Record.AccountTransactionsVendor.Code), "Account", ThisObject);
		EndIf;
		
		If ValueIsFilled(Record.AccountAdvancesCustomer) And Record.AccountAdvancesCustomer.NotUsedForRecords Then
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().AccountingError_01, Record.AccountAdvancesCustomer.Code), "Account", ThisObject);
		EndIf;
		
		If ValueIsFilled(Record.AccountTransactionsCustomer) And Record.AccountTransactionsCustomer.NotUsedForRecords Then
			CommonFunctionsClientServer.ShowUsersMessage(StrTemplate(R().AccountingError_01, Record.AccountTransactionsCustomer.Code), "Account", ThisObject);
		EndIf;
	EndDo;
EndProcedure
